import type { LocaleMessage } from '../types'

export default {
  分页: {
    前往: '前往',
    页: '页',
    每页条数: ' 条/页',
    合计: total => `共 ${total} 条`,
    向前N页: pagingCount => `向前 ${pagingCount} 页`,
    向后N页: pagingCount => `向后 ${pagingCount} 页`,
    上一页: '上一页',
    下一页: '下一页',
    分页导航: '分页导航',
    第N页: page => `第 ${page} 页`,
    当前页: page => `第 ${page} 页，当前页`,
    跳转到: '跳转到指定页',
    每页显示条数: '每页显示条数',
  },
  表格: {
    // 筛选
    确认筛选: '筛选',
    重置筛选: '重置',
    // 右键菜单
    剪切: '剪切',
    复制: '复制',
    上方插入行: '上方插入行',
    下方插入行: '下方插入行',
    删除行: '删除 $1 行',
    清空行: '清空 $1 行',
    // 删除列: '删除 $1 列',
    清空列: '清空 $1 列',
    // 隐藏列: '隐藏 $1 列',
    清空单元格: '清空单元格',
    左列冻结: '左列冻结',
    取消左列冻结: '取消左列冻结',
    右列冻结: '右列冻结',
    取消右列冻结: '取消右列冻结',
  },
} as LocaleMessage
