import type { LocaleMessage } from '../types'

export default {
  分页: {
    前往: '前往',
    页: '頁',
    每页条数: ' 筆/頁',
    合计: total => `共 ${total} 筆`,
    向前N页: pagingCount => `往前 ${pagingCount} 頁`,
    向后N页: pagingCount => `往後 ${pagingCount} 頁`,
    上一页: '上一頁',
    下一页: '下一頁',
    分页导航: '分頁導覽',
    第N页: page => `第 ${page} 頁`,
    当前页: page => `第 ${page} 頁，目前頁`,
    跳转到: '跳轉到指定頁',
    每页显示条数: '每頁顯示筆數',
  },
  表格: {
    // 篩選
    确认筛选: '篩選',
    重置筛选: '重置',
    // 右鍵選單
    剪切: '剪切',
    复制: '複製',
    上方插入行: '上方插入行',
    下方插入行: '下方插入行',
    删除行: '刪除 $1 行',
    清空行: '清空 $1 行',
    // 删除列: '刪除 $1 列',
    清空列: '清空 $1 列',
    // 隐藏列: '隱藏 $1 列',
    清空单元格: '清空儲存格',
    左列冻结: '左列凍結',
    取消左列冻结: '取消左列凍結',
    右列冻结: '右列凍結',
    取消右列冻结: '取消右列凍結',
  },
} as LocaleMessage
